export default {
	gender:[	// 性别
		{key: '1', val: '男'},
		{key: '2', val: '女'},
		{key: '0', val: '未知的性别'},
	],
	unit: [
		{key: '1', val: '岁'},
		{key: '2', val: '月'},
		{key: '3', val: '周'},
		{key: '4', val: '天'},
	],
	cardType:[	// 身份证件类别代码
		{key:'1', val:'居民身份证'},
		{key:'2', val:'居民户口簿'},
		{key:'3', val:'护照'},
		{key:'4', val:'军官证（士兵证）'},
		{key:'5', val:'驾驶执照'},
		{key:'6', val:'港澳居民来往内地通行证'},
		{key:'7', val:'台湾居民来往内地通行证'},
		{key:'99', val:'其他'},
	],
	occupation: [
		{key:'17', val:'职员'},
		{key:'13', val:'专业技术人员'},
		{key:'11', val:'国家公务员'},
		{key:'21', val:'企业管理人员'},
		{key:'24', val:'工人'},
		{key:'27', val:'农民'},
		{key:'31', val:'学生'},
		{key:'37', val:'现役军人'},
		{key:'51', val:'自由职业者'},
		{key:'54', val:'个体经营者'},
		{key:'70', val:'无业人员'},
		{key:'80', val:'退(离)休人员'},
		{key:'90', val:'其他'},
		{key:'0', val:'国家机关,党群组织,企业,事业单位负责人'}
	],
	payType: [
		{key:'2', val:'城镇居民基本医疗保险'},
		{key:'3', val:'新型农村合作医疗'},
		{key:'4', val:'贫因救助'},
		{key:'5', val:'商业医疗保险'},
		{key:'6', val:'全公费'},
		{key:'1', val:'城镇职工基本医疗保险'},
		{key:'99', val:'其他'},
	],
	PatientType: [
		{key:'2', val:'住院病人'},
		{key:'1', val:'急诊病人'},
		{key:'3', val:'门诊病人'},
	],
	nation:[	// GBT3304-1991中国各民族
		{key:'1', val:'汉族'},
		{key:'2', val:'蒙古族'},
		{key:'3', val:'回族'},
		{key:'4', val:'藏族'},
		{key:'5', val:'维吾尔族'},
		{key:'6', val:'苗族'},
		{key:'7', val:'彝族'},
		{key:'8', val:'壮族'},
		{key:'9', val:'布依族'},
		{key:'10', val:'朝鲜族'},
		{key:'11', val:'满族'},
		{key:'12', val:'侗族'},
		{key:'13', val:'瑶族'},
		{key:'14', val:'白族'},
		{key:'15', val:'土家族'},
		{key:'16', val:'哈尼族'},
		{key:'17', val:'哈萨克族'},
		{key:'18', val:'傣族'},
		{key:'19', val:'黎族'},
		{key:'20', val:'傈僳族'},
		{key:'21', val:'佤族'},
		{key:'22', val:'畲族'},
		{key:'23', val:'高山族'},
		{key:'24', val:'拉祜族'},
		{key:'25', val:'水族'},
		{key:'26', val:'东乡族'},
		{key:'27', val:'纳西族'},
		{key:'28', val:'景颇族'},
		{key:'29', val:'柯尔克孜族'},
		{key:'30', val:'土族'},
		{key:'31', val:'达斡尔族'},
		{key:'32', val:'仫佬族'},
		{key:'33', val:'羌族'},
		{key:'34', val:'布朗族'},
		{key:'35', val:'撒拉族'},
		{key:'36', val:'毛南族'},
		{key:'37', val:'仡佬族'},
		{key:'38', val:'锡伯族'},
		{key:'39', val:'阿昌族'},
		{key:'40', val:'普米族'},
		{key:'41', val:'塔吉克族'},
		{key:'42', val:'怒族'},
		{key:'43', val:'乌孜别克族'},
		{key:'44', val:'俄罗斯族'},
		{key:'45', val:'鄂温克族'},
		{key:'46', val:'德昴族'},
		{key:'47', val:'保安族'},
		{key:'48', val:'裕固族'},
		{key:'49', val:'京族'},
		{key:'50', val:'塔塔尔族'},
		{key:'51', val:'独龙族'},
		{key:'52', val:'鄂伦春族'},
		{key:'53', val:'赫哲族'},
		{key:'54', val:'门巴族'},
		{key:'55', val:'珞巴族'},
		{key:'56', val:'基诺族'},
	],

	MaritalStatus:[	// 婚姻状况代码
		{key:'10', val:'未婚'},
		{key:'20', val:'已婚'},
		{key:'23', val:'复婚'},
		{key:'30', val:'丧偶'},
		{key:'40', val:'离婚'},
	],
	nationality:[	// 国籍
		{
			val: "阿富汗",
			key : "4"
		},
		{
			val: "阿尔巴尼亚",
			key : "8"
		},
		{
			val: "阿尔及利亚",
			key : "12"
		},
		{
			val: "美属萨摩亚",
			key : "16"
		},
		{
			val: "安道尔",
			key : "20"
		},
		{
			val: "安哥拉",
			key : "24"
		},
		{
			val: "安圭拉",
			key : "660"
		},
		{
			val: "南极洲",
			key : "10"
		},
		{
			val: "安提瓜和巴布达",
			key : "28"
		},
		{
			val: "阿根廷",
			key : "32"
		},
		{
			val: "亚美尼亚",
			key : "51"
		},
		{
			val: "阿鲁巴",
			key : "533"
		},
		{
			val: "澳大利亚",
			key : "36"
		},
		{
			val: "奥地利",
			key : "40"
		},
		{
			val: "阿塞拜疆",
			key : "31"
		},
		{
			val: "巴哈马",
			key : "44"
		},
		{
			val: "巴林",
			key : "48"
		},
		{
			val: "孟加拉国",
			key : "50"
		},
		{
			val: "巴巴多斯",
			key : "52"
		},
		{
			val: "白俄罗斯",
			key : "112"
		},
		{
			val: "比利时",
			key : "56"
		},
		{
			val: "伯利兹",
			key : "84"
		},
		{
			val: "贝宁",
			key : "204"
		},
		{
			val: "百慕大",
			key : "60"
		},
		{
			val: "不丹",
			key : "64"
		},
		{
			val: "玻利维亚",
			key : "68"
		},
		{
			val: "波黑",
			key : "70"
		},
		{
			val: "博茨瓦纳",
			key : "72"
		},
		{
			val: "布维岛",
			key : "74"
		},
		{
			val: "巴西",
			key : "76"
		},
		{
			val: "英属印度洋领土",
			key : "86"
		},
		{
			val: "文莱",
			key : "96"
		},
		{
			val: "保加利亚",
			key : "100"
		},
		{
			val: "布基纳法索",
			key : "854"
		},
		{
			val: "布隆迪",
			key : "108"
		},
		{
			val: "柬埔寨",
			key : "116"
		},
		{
			val: "喀麦隆",
			key : "120"
		},
		{
			val: "加拿大",
			key : "124"
		},
		{
			val: "佛得角",
			key : "132"
		},
		{
			val: "开曼群岛",
			key : "136"
		},
		{
			val: "中非",
			key : "140"
		},
		{
			val: "乍得",
			key : "148"
		},
		{
			val: "智利",
			key : "152"
		},
		{
			val: "中国",
			key : "156"
		},
		{
			val: "香港",
			key : "344"
		},
		{
			val: "澳门",
			key : "446"
		},
		{
			val: "台湾",
			key : "158"
		},
		{
			val: "圣诞岛",
			key : "162"
		},
		{
			val: "科科斯(基林)群岛",
			key : "166"
		},
		{
			val: "哥伦比亚",
			key : "170"
		},
		{
			val: "科摩罗",
			key : "174"
		},
		{
			val: "刚果（布）",
			key : "178"
		},
		{
			val: "刚果（金）",
			key : "180"
		},
		{
			val: "库克群岛",
			key : "184"
		},
		{
			val: "哥斯达黎加",
			key: "188"
		},
		{
			val: "科特迪瓦",
			key : "384"
		},
		{
			val: "克罗地亚",
			key : "191"
		},
		{
			val: "古巴",
			key : "192"
		},
		{
			val: "塞浦路斯",
			key : "196"
		},
		{
			val: "捷克",
			key : "203"
		},
		{
			val: "丹麦",
			key : "208"
		},
		{
			val: "吉布提",
			key : "262"
		},
		{
			val: "多米尼克",
			key : "212"
		},
		{
			val: "多米尼加",
			key : "214"
		},
		{
			val: "东帝汶",
			key : "626"
		},
		{
			val: "厄瓜多尔",
			key : "218"
		},
		{
			val: "埃及",
			key : "818"
		},
		{
			val: "萨尔瓦多",
			key : "222"
		},
		{
			val: "赤道几内亚",
			key : "226"
		},
		{
			val: "厄立特里亚",
			key : "232"
		},
		{
			val: "爱沙尼亚",
			key : "233"
		},
		{
			val: "埃塞俄比亚",
			key : "231"
		},
		{
			val: "福克兰群岛(马尔维纳斯)",
			key : "238"
		},
		{
			val: "法罗群岛",
			key : "234"
		},
		{
			val: "斐济",
			key : "242"
		},
		{
			val: "芬兰",
			key : "246"
		},
		{
			val: "法国",
			key : "250"
		},
		{
			val: "法属圭亚那",
			key : "254"
		},
		{
			val: "法属波利尼西亚",
			key : "258"
		},
		{
			val: "法属南部领地",
			key : "260"
		},
		{
			val: "加蓬",
			key : "266"
		},
		{
			val: "冈比亚",
			key : "270"
		},
		{
			val: "格鲁吉亚",
			key : "268"
		},
		{
			val: "德国",
			key : "276"
		},
		{
			val: "加纳",
			key : "288"
		},
		{
			val: "直布罗陀",
			key : "292"
		},
		{
			val: "希腊",
			key : "300"
		},
		{
			val: "格陵兰",
			key : "304"
		},
		{
			val: "格林纳达",
			key : "308"
		},
		{
			val: "瓜德罗普",
			key : "312"
		},
		{
			val: "关岛",
			key : "316"
		},
		{
			val: "危地马拉",
			key : "320"
		},
		{
			val: "几内亚",
			key : "324"
		},
		{
			val: "几内亚比绍",
			key : "624"
		},
		{
			val: "圭亚那",
			key : "328"
		},
		{
			val: "海地",
			key : "332"
		},
		{
			val: "赫德岛和麦克唐纳岛",
			key : "334"
		},
		{
			val: "洪都拉斯",
			key : "340"
		},
		{
			val: "匈牙利",
			key : "348"
		},
		{
			val: "冰岛",
			key : "352"
		},
		{
			val: "印度",
			key : "356"
		},
		{
			val: "印度尼西亚",
			key : "360"
		},
		{
			val: "伊朗",
			key : "364"
		},
		{
			val: "伊拉克",
			key : "368"
		},
		{
			val: "爱尔兰",
			key : "372"
		},
		{
			val: "以色列",
			key : "376"
		},
		{
			val: "意大利",
			key : "380"
		},
		{
			val: "牙买加",
			key : "388"
		},
		{
			val: "日本",
			key : "392"
		},
		{
			val: "约旦",
			key : "400"
		},
		{
			val: "哈萨克斯坦",
			key : "398"
		},
		{
			val: "肯尼亚",
			key : "404"
		},
		{
			val: "基里巴斯",
			key : "296"
		},
		{
			val: "朝鲜",
			key : "408"
		},
		{
			val: "韩国",
			key : "410"
		},
		{
			val: "科威特",
			key : "414"
		},
		{
			val: "吉尔吉斯斯坦",
			key : "417"
		},
		{
			val: "老挝",
			key : "418"
		},
		{
			val: "拉脱维亚",
			key : "428"
		},
		{
			val: "黎巴嫩",
			key : "422"
		},
		{
			val: "莱索托",
			key : "426"
		},
		{
			val: "利比里亚",
			key : "430"
		},
		{
			val: "利比亚",
			key : "434"
		},
		{
			val: "列支敦土登",
			key : "438"
		},
		{
			val: "立陶宛",
			key : "440"
		},
		{
			val: "卢森堡",
			key : "442"
		},
		{
			val: "前南马其顿",
			key : "807"
		},
		{
			val: "马达加斯加",
			key : "450"
		},
		{
			val: "马拉维",
			key : "454"
		},
		{
			val: "马来西亚",
			key : "458"
		},
		{
			val: "马尔代夫",
			key : "462"
		},
		{
			val: "马里",
			key : "466"
		},
		{
			val: "马耳他",
			key : "470"
		},
		{
			val: "马绍尔群岛",
			key : "584"
		},
		{
			val: "马提尼克",
			key : "474"
		},
		{
			val: "毛里塔尼亚",
			key : "478"
		},
		{
			val: "毛里求斯",
			key : "480"
		},
		{
			val: "马约特",
			key : "175"
		},
		{
			val: "墨西哥",
			key : "484"
		},
		{
			val: "密克罗尼亚联邦",
			key : "583"
		},
		{
			val: "摩尔多瓦",
			key : "498"
		},
		{
			val: "摩纳哥",
			key : "492"
		},
		{
			val: "蒙古",
			key : "496"
		},
		{
			val: "蒙特塞拉特",
			key : "500"
		},
		{
			val: "摩洛哥",
			key : "504"
		},
		{
			val: "莫桑比克",
			key : "508"
		},
		{
			val: "缅甸",
			key : "104"
		},
		{
			val: "纳米比亚",
			key : "516"
		},
		{
			val: "瑙鲁",
			key : "520"
		},
		{
			val: "尼泊尔",
			key : "524"
		},
		{
			val: "荷兰",
			key : "528"
		},
		{
			val: "荷属安的列斯",
			key : "530"
		},
		{
			val: "新喀里多尼亚",
			key: "540"
		},
		{
			val: "新西兰",
			key : "554"
		},
		{
			val: "尼加拉瓜",
			key : "558"
		},
		{
			val: "尼日尔",
			key : "562"
		},
		{
			val: "尼日利亚",
			key : "566"
		},
		{
			val: "纽埃",
			key : "570"
		},
		{
			val: "诺福克岛",
			key : "574"
		},
		{
			val: "北马里亚纳",
			key : "580"
		},
		{
			val: "挪威",
			key : "578"
		},
		{
			val: "阿曼",
			key : "512"
		},
		{
			val: "巴基斯坦",
			key : "586"
		},
		{
			val: "帕劳",
			key : "585"
		},
		{
			val: "巴勒斯坦",
			key : "582"
		},
		{
			val: "巴拿马",
			key : "591"
		},
		{
			val: "巴布亚新几内亚",
			key : "598"
		},
		{
			val: "巴拉圭",
			key : "600"
		},
		{
			val: "秘鲁",
			key : "604"
		},
		{
			val: "菲律滨",
			key : "608"
		},
		{
			val: "皮特凯恩",
			key : "612"
		},
		{
			val: "波兰",
			key : "616"
		},
		{
			val: "葡萄牙",
			key : "620"
		},
		{
			val: "波多黎各",
			key : "630"
		},
		{
			val: "卡诺尔",
			key : "634"
		},
		{
			val: "留尼汪",
			key : "638"
		},
		{
			val: "罗马尼亚",
			key : "642"
		},
		{
			val: "俄罗斯联邦",
			key : "643"
		},
		{
			val: "卢旺达",
			key : "646"
		},
		{
			val: "圣赫勒拿",
			key : "654"
		},
		{
			val: "圣基茨-尼维斯",
			key : "659"
		},
		{
			val: "圣卢西亚",
			key : "662"
		},
		{
			val: "圣皮埃尔和密克隆",
			key : "666"
		},
		{
			val: "圣文森特和格林纳丁斯",
			key : "670"
		},
		{
			val: "萨摩亚",
			key : "882"
		},
		{
			val: "圣马力诺",
			key : "674"
		},
		{
			val: "圣多美和普林西比",
			key : "678"
		},
		{
			val: "沙特阿拉伯",
			key : "682"
		},
		{
			val: "塞内加尔",
			key : "686"
		},
		{
			val: "塞舌尔",
			key : "690"
		},
		{
			val: "塞拉利昂",
			key : "694"
		},
		{
			val: "新加坡",
			key : "702"
		},
		{
			val: "斯洛伐克",
			key : "703"
		},
		{
			val: "斯洛文尼亚",
			key : "705"
		},
		{
			val: "所罗门群岛",
			key : "90"
		},
		{
			val: "索马里",
			key : "706"
		},
		{
			val: "南非",
			key : "710"
		},
		{
			val: "南乔治亚和南桑德韦奇岛",
			key : "239"
		},
		{
			val: "西班牙",
			key : "724"
		},
		{
			val: "斯里兰卡",
			key : "732"
		},
		{
			val: "苏丹",
			key : "736"
		},
		{
			val: "苏里南",
			key : "740"
		},
		{
			val: "斯瓦尔巴岛和扬马延岛",
			key : "744"
		},
		{
			val: "斯威士兰",
			key : "748"
		},
		{
			val: "瑞典",
			key : "752"
		},
		{
			val: "瑞士",
			key : "756"
		},
		{
			val: "叙利亚",
			key : "760"
		},
		{
			val: "塔吉克斯坦",
			key : "762"
		},
		{
			val: "坦桑尼亚",
			key : "834"
		},
		{
			val: "泰国",
			key : "764"
		},
		{
			val: "多哥",
			key : "768"
		},
		{
			val: "托克劳",
			key : "772"
		},
		{
			val: "汤加",
			key : "776"
		},
		{
			val: "特立尼达和多哥巴",
			key : "780"
		},
		{
			val: "突尼斯",
			key : "788"
		},
		{
			val: "土耳其",
			key : "792"
		},
		{
			val: "土库曼斯坦",
			key : "795"
		},
		{
			val: "特克斯和凯科斯群岛",
			key : "796"
		},
		{
			val: "图瓦卢",
			key : "798"
		},
		{
			val: "乌干达",
			key : "800"
		},
		{
			val: "乌克兰",
			key : "804"
		},
		{
			val: "阿联酋",
			key : "784"
		},
		{
			val: "英国",
			key : "826"
		},
		{
			val: "美国",
			key : "840"
		},
		{
			val: "美国本土外小岛屿",
			key : "581"
		},
		{
			val: "乌拉圭",
			key : "858"
		},
		{
			val: "乌兹别克斯坦",
			key : "860"
		},
		{
			val: "瓦努阿图",
			key : "548"
		},
		{
			val: "梵蒂冈",
			key : "336"
		},
		{
			val: "委内瑞拉",
			key : "862"
		},
		{
			val: "越南",
			key : "704"
		},
		{
			val: "英属维尔京群岛",
			key : "92"
		},
		{
			val: "瓦利斯和富图纳",
			key : "876"
		},
		{
			val: "西撒哈拉",
			key : "732"
		},
		{
			val: "也门",
			key : "887"
		},
		{
			val: "南斯拉夫",
			key : "891"
		},
		{
			val: "赞比亚",
			key : "894"
		},
		{
			val: "津巴布韦",
			key : "716"
		}
	]

}
